app/controllers/url_controller.rb

SELECT * FROM `urls` ORDER BY created_at DESC
---
  def index
    @urls = Url.all(:order => "created_at DESC")

SELECT `urls`.id FROM `urls` WHERE (`urls`.`url` = BINARY 'google.com') LIMIT 1
INSERT INTO `urls` (`created_at`, `updated_at`, `url`) VALUES('2012-02-04 09:23:29', '2012-02-04 09:23:29', 'google.com')
---
  def sync
    if not params.has_key?(:urls)
      render :json => {:status => 1, :message => 'Invalid Parameter'}
      return
    end

    @urls = params[:urls]
    if not @urls.nil?
      @urls.each do |url|
        @url = Url.new(:url => url)
        begin
          @url.save!